wingOnly/cruise/system/sampleDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFormat vtk;
interpolationScheme cellPoint;

type surfaces;
libs ("libsampling.so");

// Fields to sample.
fields
(
    liftPerS p
);

surfaces
(
    wing
    {
        type            patch;
        patches         ( "wing" );
        triangulate     false;
    }
    wing
    {
        type            patch;
        patches         ( "wing" );
        triangulate     false;
    }

);
